           >>source format free
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
AUTHOR. Amber Olsen.
DATE-WRITTEN. september 14.
ENVIRONMENT DIVISION


DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STUDENT_NAME PIC X(12).
01 WS-DATE PIC X(10).

PROCEDURE DIVISION.
DISPLAY "What is your name?"
ACCEPT WS-STUDENT_NAME.
ACCEPT WS-DATE FROM DATE.
DISPLAY "Name : " WS-STUDENT_NAME.
DISPLAY "DATE : " WS-DATE.

STOP RUN.
